IRP/src/Documents/ExternalAccountingOperation/ExternalAccountingOperation.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
 <name>ExternalAccountingOperation</name>
 <registerRecords>AccumulationRegister.T1050T_AccountingQuantities</registerRecords>
 <registerRecords>InformationRegister.PostedDocumentsRegistry</registerRecords>
 <registerRecords>AccumulationRegister.T1040T_AccountingAmounts</registerRecords>
 <attributes>
  <name>RecorderRef</name>
  <type>
   <types>UUID</types>
  </type>
 </attributes>
 <attributes>
  <name>RecorderPresentation</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>1024</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>RecorderURL</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>200</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>LedgerType</name>
  <type>
   <types>CatalogRef.LedgerTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>RecorderName</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>100</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>IsOpeningEntry</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>AccountingCurrency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </attributes>
 <attributes>
  <name>DocumentCurrency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </attributes>
 <tabularSections>
  <name>Records</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Period</name>
   <type>
    <types>Date</types>
   </type>
  </attributes>
  <attributes>
   <name>Activity</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>CompanyRef</name>
   <type>
    <types>UUID</types>
   </type>
  </attributes>
  <attributes>
   <name>CompanyPresentation</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>50</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>Company</name>
   <type>
    <types>CatalogRef.Companies</types>
   </type>
  </attributes>
  <attributes>
   <name>CurrencyRef</name>
   <type>
    <types>UUID</types>
   </type>
  </attributes>
  <attributes>
   <name>CurrencyPresentation</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>10</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>Currency</name>
   <type>
    <types>CatalogRef.Currencies</types>
   </type>
  </attributes>
  <attributes>
   <name>AccountDrRef</name>
   <type>
    <types>UUID</types>
   </type>
  </attributes>
  <attributes>
   <name>AccountDrPresentation</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>20</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>AccountDr</name>
   <type>
    <types>ChartOfAccountsRef.Basic</types>
   </type>
  </attributes>
  <attributes>
   <name>CurrencyDrRef</name>
   <type>
    <types>UUID</types>
   </type>
  </attributes>
  <attributes>
   <name>CurrencyDrPresentation</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>10</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>CurrencyDr</name>
   <type>
    <types>CatalogRef.Currencies</types>
   </type>
  </attributes>
  <attributes>
   <name>AmountCurrencyDr</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>QuantityDr</name>
   <type>
    <types>DefinedType.typeQuantity</types>
   </type>
  </attributes>
  <attributes>
   <name>AccountCrRef</name>
   <type>
    <types>UUID</types>
   </type>
  </attributes>
  <attributes>
   <name>AccountCrPresentation</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>20</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>AccountCr</name>
   <type>
    <types>ChartOfAccountsRef.Basic</types>
   </type>
  </attributes>
  <attributes>
   <name>CurrencyCrRef</name>
   <type>
    <types>UUID</types>
   </type>
  </attributes>
  <attributes>
   <name>CurrencyCrPresentation</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>10</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>CurrencyCr</name>
   <type>
    <types>CatalogRef.Currencies</types>
   </type>
  </attributes>
  <attributes>
   <name>AmountCurrencyCr</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>QuantityCr</name>
   <type>
    <types>DefinedType.typeQuantity</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>OperationTitle</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>1024</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ChartNameDr</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>50</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ChartNameCr</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>50</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ExtDimensionRefDr1</name>
   <type>
    <types>UUID</types>
   </type>
  </attributes>
  <attributes>
   <name>BaseClassDr1</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>20</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ClassDr1</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>150</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ExtDimensionValueDr1</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>50</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ExtDimensionTypeDr1</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AccountingExtraDimensionTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>InternalBaseClassDr1</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>20</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>InternalClassDr1</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>150</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>InternalExtDimensionValueDr1</name>
   <type>
    <types>Characteristic.AccountingExtraDimensionTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>ExtDimensionRefDr2</name>
   <type>
    <types>UUID</types>
   </type>
  </attributes>
  <attributes>
   <name>BaseClassDr2</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>20</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ClassDr2</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>150</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ExtDimensionValueDr2</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>50</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ExtDimensionTypeDr2</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AccountingExtraDimensionTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>InternalBaseClassDr2</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>20</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>InternalClassDr2</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>150</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>InternalExtDimensionValueDr2</name>
   <type>
    <types>Characteristic.AccountingExtraDimensionTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>ExtDimensionRefDr3</name>
   <type>
    <types>UUID</types>
   </type>
  </attributes>
  <attributes>
   <name>BaseClassDr3</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>20</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ClassDr3</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>150</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ExtDimensionValueDr3</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>50</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ExtDimensionTypeDr3</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AccountingExtraDimensionTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>InternalBaseClassDr3</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>20</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>InternalClassDr3</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>150</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>InternalExtDimensionValueDr3</name>
   <type>
    <types>Characteristic.AccountingExtraDimensionTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>ExtDimensionRefCr1</name>
   <type>
    <types>UUID</types>
   </type>
  </attributes>
  <attributes>
   <name>BaseClassCr1</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>20</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ClassCr1</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>150</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ExtDimensionValueCr1</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>50</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ExtDimensionTypeCr1</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AccountingExtraDimensionTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>InternalBaseClassCr1</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>20</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>InternalClassCr1</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>150</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>InternalExtDimensionValueCr1</name>
   <type>
    <types>Characteristic.AccountingExtraDimensionTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>ExtDimensionRefCr2</name>
   <type>
    <types>UUID</types>
   </type>
  </attributes>
  <attributes>
   <name>BaseClassCr2</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>20</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ClassCr2</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>150</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ExtDimensionValueCr2</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>50</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ExtDimensionTypeCr2</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AccountingExtraDimensionTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>InternalBaseClassCr2</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>20</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>InternalClassCr2</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>150</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>InternalExtDimensionValueCr2</name>
   <type>
    <types>Characteristic.AccountingExtraDimensionTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>ExtDimensionRefCr3</name>
   <type>
    <types>UUID</types>
   </type>
  </attributes>
  <attributes>
   <name>BaseClassCr3</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>20</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ClassCr3</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>150</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ExtDimensionValueCr3</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>50</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ExtDimensionTypeCr3</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AccountingExtraDimensionTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>InternalBaseClassCr3</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>20</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>InternalClassCr3</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>150</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>InternalExtDimensionValueCr3</name>
   <type>
    <types>Characteristic.AccountingExtraDimensionTypes</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>Currencies</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>CurrencyFrom</name>
   <type>
    <types>CatalogRef.Currencies</types>
   </type>
  </attributes>
  <attributes>
   <name>Rate</name>
   <type>
    <types>DefinedType.typeCurrencyRate</types>
   </type>
  </attributes>
  <attributes>
   <name>ReverseRate</name>
   <type>
    <types>DefinedType.typeCurrencyRate</types>
   </type>
  </attributes>
  <attributes>
   <name>ShowReverseRate</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>Multiplicity</name>
   <type>
    <types>Number</types>
    <numberQualifiers>
     <precision>10</precision>
    </numberQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>MovementType</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>IsFixed</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>Errors</name>
  <attributes>
   <name>Error</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>1024</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Document>

IRP/src/Documents/ExternalAccountingOperation/ObjectModule.bsl
Procedure BeforeWrite(Cancel, WriteMode, PostingMode)
	If DataExchange.Load Then
		Return;
	EndIf;	
			
	CurrenciesClientServer.DeleteUnusedRowsFromCurrenciesTable(ThisObject.Currencies, ThisObject.Records);
	For Each Row In ThisObject.Records Do
		Parameters = CurrenciesClientServer.GetParameters_V15(ThisObject, Row);
		CurrenciesClientServer.DeleteRowsByKeyFromCurrenciesTable(ThisObject.Currencies, Row.Key);
		CurrenciesServer.UpdateCurrencyTable(Parameters, ThisObject.Currencies);
	EndDo;	
	
	ThisObject.AdditionalProperties.Insert("WriteMode", WriteMode);				
EndProcedure

Procedure OnWrite(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
	
	WriteMode = CommonFunctionsClientServer.GetFromAddInfo(ThisObject.AdditionalProperties, "WriteMode");
	If FOServer.IsUseAccounting() And WriteMode = DocumentWriteMode.Posting Then
		AccountingServer.OnWrite(ThisObject, Cancel, "Records");
	EndIf;
	
EndProcedure

Procedure BeforeDelete(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
EndProcedure

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	Return;
EndProcedure

Procedure Posting(Cancel, PostingMode)
	PostingServer.Post(ThisObject, Cancel, PostingMode, ThisObject.AdditionalProperties);
EndProcedure

Procedure UndoPosting(Cancel)
	UndopostingServer.Undopost(ThisObject, Cancel, ThisObject.AdditionalProperties);
EndProcedure
